app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "   @micropost = current_user.microposts.build(micropost_params)"], ["user_id", 1], ["created_at", "2021-05-10 03:31:47.711550"], ["updated_at", "2021-05-10 03:31:47.711550"]]
---
  def create
    # @post = Post.new(post_params)
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "sfddsfs"], ["updated_at", "2021-05-10 03:45:52.762676"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)